{"title": "10 TIPS TO HOST YOUR WEB APPS FOR FREE", "content": "<section class=\"post-content\">\n<div class=\"kg-card-markdown\">\n<h4 id=\"aguidetonavigatingofthecompetitivemarketplaceofcloudserviceproviders\">A guide to navigating of the competitive marketplace of cloud service providers.</h4>\n<p>2017 is a great year to deploy a web app.</p>\n<p>The landscape of web service providers is incredibly competitive right now, and almost all of them offer generous free plans as an attempt to acquire long-term customers.</p>\n<p><img class=\"alignnone size-full wp-image-487\" src=\"https://emolike.net/wp-content/uploads/2018/04/free-hosting-meme.jpg\" width=\"565\" height=\"313\" alt=\"Free Hosting Meme\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/free-hosting-meme.jpg 565w, https://emolike.net/wp-content/uploads/2018/04/free-hosting-meme-300x166.jpg 300w, https://emolike.net/wp-content/uploads/2018/04/free-hosting-meme-487x270.jpg 487w\" sizes=\"(max-width: 565px) 100vw, 565px\" /></p>\n<p>This article is a collection of tips, from my own experience, on hosting high-performance web apps for free. If you are experienced in deploying web apps, then you are probably already familiar with many of the services and techniques that we will cover, but I hope that you will still learn something new. If you are a newcomer to web application deployment, I hope that this article will help to guide you to the best services and to avoid some of the potential pitfalls.</p>\n<p><em>Note - I am not being paid or sponsored by any of these services. This is just advice based on my experience at various organizations, and on how I host my own web applications.</em></p>\n<blockquote>\n<h4 id=\"staticfrontendwebsites\">Static Front-End Websites</h4>\n<p>The first 5 tips are for static websites. These are self-contained websites, consisting of HTML, CSS, and Javascript files, that do not rely on custom server-side APIs or databases to function.</p></blockquote>\n<h4 id=\"1avoidwebsitehostingcompanies\">1. Avoid “Website Hosting” companies</h4>\n<p>Thousands of website hosting companies compete to provide web services to non-technical customers and small businesses. These companies often place a priority on advertising/marketing over actually providing a great service; some examples include Bluehost, GoDaddy, HostGator, and iPage.</p>\n<p><img class=\"alignnone size-full wp-image-488\" src=\"https://emolike.net/wp-content/uploads/2018/04/webhosting.png\" width=\"1024\" height=\"679\" alt=\"Web Hosting = Bad Deal\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/webhosting.png 1024w, https://emolike.net/wp-content/uploads/2018/04/webhosting-300x199.png 300w, https://emolike.net/wp-content/uploads/2018/04/webhosting-768x509.png 768w, https://emolike.net/wp-content/uploads/2018/04/webhosting-407x270.png 407w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></p>\n<p>Almost all of these companies offer sub-par shared-hosting deals with deceptive pricing models. The pricing plans are usually not a good value, and you can achieve better results for free (or for very, very cheap) by using the tools described later in this post.</p>\n<p>These services are only good options for people who want the least-technical experience possible, and who are willing to pay 10-1000x as much per month in exchange for a marginally simpler setup experience.</p>\n<p>Many of these companies have highly-polished homepages offering aggressively-discounted “80% off for the first 12 Months” types of deals. They will then make it difficult to remove payment methods and/or cancel the plan, and will automatically charge you $200-$400 dollars for an automatic upgrade to 12-24 months of the “premium plan” a year later. This is how these companies make their money, don’t fall for it.</p>\n<h4 id=\"2donthostonyourownhardwareunlessyoureallyknowwhatyouredoing\">2. Don’t host on your own hardware (unless you really know what you’re doing)</h4>\n<p>Another option is to host the website on your personal computer. This is a really a <em>Very Bad Idea</em>. Your computer will be slow, your website will be unreliable, and your personal computer (and entire home network) will probably get hacked. Not good.</p>\n<p><img class=\"alignnone size-full wp-image-489\" src=\"https://emolike.net/wp-content/uploads/2018/04/gatsby-hacked.jpg\" width=\"600\" height=\"400\" alt=\"You've been hacked\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/gatsby-hacked.jpg 600w, https://emolike.net/wp-content/uploads/2018/04/gatsby-hacked-300x200.jpg 300w, https://emolike.net/wp-content/uploads/2018/04/gatsby-hacked-405x270.jpg 405w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></p>\n<p>You could also buy your own server hardware dedicated to hosting the website. In order to do this, however, you’ll need a solid understanding of network hardware and software, a blazing-fast internet connection, and a reliable power supply. Even then, you still might be opening up your home network to security risks, the upfront costs could be significant, and the site will still likely never be as fast as it would be if hosted in an enterprise data center.</p>\n<h4 id=\"3usegithubpagesforstaticwebsitehosting\">3. Use GitHub pages for static website hosting</h4>\n<p>Front-end project code on GitHub can be hosted using <a href=\"https://pages.github.com/\">GitHub Pages</a>. The biggest advantage here is that the hosting is 100% free, which is pretty sweet. They also provide a GitHub pages subdomain (<code>yoursite.github.io</code>) hosted over HTTPS.</p>\n<p><img class=\"alignnone size-full wp-image-490\" src=\"https://emolike.net/wp-content/uploads/2018/04/gh-pages.png\" width=\"720\" height=\"328\" alt=\"Github Pages\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/gh-pages.png 720w, https://emolike.net/wp-content/uploads/2018/04/gh-pages-300x137.png 300w, https://emolike.net/wp-content/uploads/2018/04/gh-pages-593x270.png 593w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></p>\n<p>The main disadvantage of this offering is in flexibility, or the lack thereof.</p>\n<p>For an ultra-basic website, with an <code>index.html</code> file at the root of the project, a handful JS/CSS/image resources, and no build system, GitHub Pages works very well.</p>\n<p>Larger projects, however, often have more complex directory layouts, such as a pre-built <code>src</code> directory containing the source code modules, a <code>node_modules</code> directory containing external dependencies, and a separate <code>public</code> directory containing the built website files. These projects can be difficult to configure in order to work correctly with GitHub Pages since it is configured to serve from the root of the repository.</p>\n<p>It is possible to have a GH pages site only serve from, say, the project’s <code>public</code> or <code>dist</code>subdirectory, but it requires setting up a git subtree for that directory prefix, which can be a bit complex. For more advanced projects, I’ve found that using a cloud storage service is generally simpler and provides greater flexibility.</p>\n<h4 id=\"4usecloudstorageservicesforstaticwebsitehosting\">4. Use cloud storage services for static website hosting</h4>\n<p><a href=\"https://aws.amazon.com/s3/pricing/\">AWS S3</a>, <a href=\"https://azure.microsoft.com/en-us/services/storage/\">Microsoft Azure Storage</a>, and <a href=\"https://cloud.google.com/storage/\">Google Cloud Storage</a> are ultra-cheap, ultra-fast, ultra-reliable file storage services. These products are commonly used by corporations to archive massive collections of data and media, but you can also host a website on them for very, very cheap.</p>\n<p><strong>These are the best options for hosting a static website, in my opinion.</strong></p>\n<p><img class=\"alignnone size-full wp-image-491\" src=\"https://emolike.net/wp-content/uploads/2018/04/cloudhosting.png\" width=\"1280\" height=\"462\" alt=\"AWS, Azure, and GCP\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/cloudhosting.png 1280w, https://emolike.net/wp-content/uploads/2018/04/cloudhosting-300x108.png 300w, https://emolike.net/wp-content/uploads/2018/04/cloudhosting-768x277.png 768w, https://emolike.net/wp-content/uploads/2018/04/cloudhosting-1024x370.png 1024w, https://emolike.net/wp-content/uploads/2018/04/cloudhosting-604x218.png 604w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<p>These services allow you to upload files to “storage buckets” (think enterprise-friendly Dropbox). You can then to make the bucket contents publicly available (for read access) to the rest of the internet, allowing you to serve the bucket contents as a website.</p>\n<p>Here are tutorials for how to do this with each service -</p>\n<ul>\n<li><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/WebsiteHosting.html\">Hosting a Static Website on Amazon S3</a></li>\n<li><a href=\"https://cloud.google.com/storage/docs/hosting-static-website\">Hosting a Static Website on Google Cloud Storage</a></li>\n<li><a href=\"https://buildazure.com/2016/11/30/static-website-hosting-in-azure-storage/\">Hosting a Static Website on Microsoft Azure</a></li>\n</ul>\n<p>The great thing about this setup (unlike the pricing models of “web hosting” companies such as Bluehost and Godaddy) is that <strong>you only pay for the storage and bandwidth that you use</strong>.</p>\n<p>The resulting website will be <em>very</em> fast, scalable, and reliable, since it will be served from the same infrastructure that companies such as Netflix, Spotify, and Pinterest use for their own resources.</p>\n<p>Here is a pricing breakdown <sup class=\"footnote-ref\"><a id=\"fnref1\" href=\"https://blog.patricktriest.com/host-webapps-free/#fn1\">[1]</a></sup><sup class=\"footnote-ref\"><a id=\"fnref2\" href=\"https://blog.patricktriest.com/host-webapps-free/#fn2\">[2]</a></sup><sup class=\"footnote-ref\"><a id=\"fnref3\" href=\"https://blog.patricktriest.com/host-webapps-free/#fn3\">[3]</a></sup> -</p>\n<table>\n<tbody>\n<tr>\n<th></th>\n<th>AWS S3</th>\n<th>Google Cloud Storage</th>\n<th>Azure Storage</th>\n</tr>\n<tr>\n<td>File Storage per GB per month</td>\n<td>$0.023</td>\n<td>$0.026</td>\n<td>$0.024</td>\n</tr>\n<tr>\n<td>Data Transfer per GB</td>\n<td>$0.09</td>\n<td>$0.11</td>\n<td>$0.087</td>\n</tr>\n</tbody>\n</table>\n<p><em>Note that pricing can vary by region. Also, some of these services charge additional fees, such as for each HTTP GET request; see the official pricing pages in the footnotes for more details.</em></p>\n<p>For most websites, these costs will come out to almost nothing, regardless of which service you choose. The data storage costs will be totally negligible for any website, and the data transfer costs can be all-but-eliminated by serving the site from behind a CDN (see <a href=\"https://blog.patricktriest.com/host-webapps-free/#tip-10\">tip #10</a>). Furthermore, you can leverage the free credits available for these services in order to host your static websites without paying a single dime (skip to <a href=\"https://blog.patricktriest.com/host-webapps-free/#tip-5\">tip #5</a> for more details).</p>\n<p>If you need to host a site with lots of hi-res photo/video content, I would recommend storing your photos separately on a service such as <a href=\"https://imgur.com/\">Imgur</a>, and embedding your videos from <a href=\"https://www.youtube.com/\">Youtube</a> or <a href=\"https://vimeo.com/\">Vimeo</a>. This tactic will allow you to host lots of media without footing the bill for associated data transfer costs.</p>\n<blockquote>\n<h4 id=\"dynamicwebapps\">Dynamic Web Apps</h4>\n<p>Now for the trickier part - cheaply hosting a web app that relies on a backend and/or database to function. This includes most blogs (unless you use a <a href=\"https://davidwalsh.name/introduction-static-site-generators\">static site generator</a>), as well as any website that requires users to log in and to submit/edit content. Generally, it would cost at least $5 per month to rent a cloud compute instance for this purpose, but there are a few good ways to circumvent these fees.</p></blockquote>\n<h4 id=\"5leveragecloudhostingproviderfreeplans\">5. Leverage cloud hosting provider free plans</h4>\n<p>The most popular option for server-based apps are cloud hosting services, such as <a href=\"https://cloud.google.com/\">Google Cloud Platform</a> (GCP), <a href=\"https://aws.amazon.com/\">Amazon Web Services</a> (AWS), and <a href=\"https://azure.microsoft.com/\">Microsoft Azure</a>. These services are in fierce competition with each other, and have so much capital and infrastructure available that they are willing to give away money and compute power in order to get users hooked on their respective platforms.</p>\n<p><img class=\"alignnone size-full wp-image-492\" src=\"https://emolike.net/wp-content/uploads/2018/04/freemoney.gif\" width=\"500\" height=\"369\" alt=\"Free Money\" /></p>\n<p>Google Cloud Platform automatically provides $300 worth of credit to anyone who joins and allows you to run a small (f1-micro) server at no cost, indefinitely, along with providing a variety of other free-tier usage limits. See here for more info - <a href=\"https://cloud.google.com/free/\">https://cloud.google.com/free/</a></p>\n<p>AWS offers very similar free-tier limits to GCP, allowing you to run 1 small compute instance (t2-micro) for free each month. See here - <a href=\"https://aws.amazon.com/free/\">https://aws.amazon.com/free/</a></p>\n<p>Microsoft Azure offers $200 in free credit when you join, but this free credit expires after one month. They also provide a free tier on their “App Service” offering, although this free tier is more limited than the equivalent offerings from AWS and GCP. See here - <a href=\"https://azure.microsoft.com/en-us/free\">https://azure.microsoft.com/en-us/free</a></p>\n<p>Personally, <strong>I would recommend GCP</strong> since their free plan is the most robust, and their web admin interface is the most polished and pleasant to work with.</p>\n<blockquote><p>Note - If you are a student, Github offers a really fantastic pack of free stuff, <a href=\"https://education.github.com/pack\">https://education.github.com/pack</a>, including $110 in AWS credits, $50 in <a href=\"https://www.digitalocean.com/\">DigitalOcean</a> credits, and much more.</p></blockquote>\n<h4 id=\"6useherokuforfreebackendapphosting\">6. Use Heroku for free backend app hosting</h4>\n<p><a href=\"https://www.heroku.com/\">Heroku</a> also offers a free tier. The difference with Heroku is that you can indefinitely <strong>run up to 100 backend apps at the same time for free</strong>. Not only will they provide a server for your application code to run on, but there are also lots of free plugins to add databases and other external services to your application cluster. It’s worth noting that Heroku has a wonderful, developer focused user-experience compared to its competitors.</p>\n<p><img class=\"alignnone size-full wp-image-493\" src=\"https://emolike.net/wp-content/uploads/2018/04/heroku.png\" width=\"1280\" height=\"540\" alt=\"Heroku\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/heroku.png 1280w, https://emolike.net/wp-content/uploads/2018/04/heroku-300x127.png 300w, https://emolike.net/wp-content/uploads/2018/04/heroku-768x324.png 768w, https://emolike.net/wp-content/uploads/2018/04/heroku-1024x432.png 1024w, https://emolike.net/wp-content/uploads/2018/04/heroku-604x255.png 604w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />There is, of course, a catch - <strong>you are limited to 1000 free app-hours per month</strong>. This means that you’ll only be able to run 1 app full-time for the entire month (730 hours). Additionally, Heroku’s free servers will “sleep” after 30 minutes of inactivity; the next time someone makes a request to the server it will take around 15-20 seconds to respond at first while it “wakes up”. The good news is that when servers are asleep, they don’t count towards to monthly limit, so you could theoretically host 100 low-traffic apps on Heroku completely for free, and just let them wake up for the occasional visitor.</p>\n<p>The <a href=\"https://www.heroku.com/pricing\">Heroku free plan</a> is a great option for casual side projects, test environments, and low-traffic, non-critical applications.</p>\n<blockquote><p><a href=\"https://zeit.co/now\">Now</a>, from Zeit, is a similar service to Heroku, with a more minimalist focus. It offers near-unlimited free hosting for Node.js and Docker based applications, along with a simple, developer-focused CLI tool. You might want to check this out if you like Heroku, but don’t need all of the Github integrations, CI tools, and plugin support.</p></blockquote>\n<h4 id=\"7usefirebaseforappswithstraightforwardbackendrequirements\">7. Use Firebase for apps with straightforward backend requirements</h4>\n<p><a href=\"https://firebase.google.com/\">Firebase</a> is Google’s backend-as-a-service, and is the dominant entrant in this field at the moment. Firebase provides a suite of backend services, such as database-storage, user authentication, client-side SDKs, and in-depth analytics and monitoring. Firebase offers an unlimited-duration <a href=\"https://firebase.google.com/pricing/\">free plan</a>, with usage limits on some of the features. Additionally, you can host your frontend website on Firebase for free, with up to 1GB of file storage and 10GB of data transfer per month.</p>\n<p><img class=\"alignnone size-full wp-image-494\" src=\"https://emolike.net/wp-content/uploads/2018/04/firebase.png\" width=\"1280\" height=\"656\" alt=\"Firebase\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/firebase.png 1280w, https://emolike.net/wp-content/uploads/2018/04/firebase-300x154.png 300w, https://emolike.net/wp-content/uploads/2018/04/firebase-768x394.png 768w, https://emolike.net/wp-content/uploads/2018/04/firebase-1024x525.png 1024w, https://emolike.net/wp-content/uploads/2018/04/firebase-527x270.png 527w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />For applications that just allow users to log in and store/share data (such as a social networking app), Firebase can be a great choice. For applications with more advanced backend requirements, such as complex database schemas or high-security user/organization authorization handling, writing a custom backend might be a simpler, more scalable solution than Firebase in the long-run.</p>\n<p>Firebase offers “Cloud Functions” to write specific app logic and run custom jobs, but these functions are more limited in capability than running your own backend server (they can only be written using Node.js, for instance). You can also use a “Cloud Function” style architecture without specifically using Firebase, as we’ll see in the next section.</p>\n<h4 id=\"8useaserverlessarchitecture\">8. Use a serverless architecture</h4>\n<p>Serverless architecture is an emerging paradigm for backed infrastructure design where instead of managing a full server to run your API code, you can run individual functions on-demand using services such as <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>, <a href=\"https://cloud.google.com/functions/docs/\">Google Cloud Functions</a>, or <a href=\"https://docs.microsoft.com/en-us/azure/azure-functions/functions-overview\">Azure Functions</a>.</p>\n<blockquote><p>Note - “Serverless” is a buzzy, somewhat misleading term; <strong>your application code still runs on servers</strong>, you just don’t have to manage them. Also, note that while the core application logic can be “serverless”, you’ll probably still need to have a persistent server somewhere in order to host your application database.</p></blockquote>\n<p><img class=\"alignnone size-full wp-image-495\" src=\"https://emolike.net/wp-content/uploads/2018/04/serverless-2.png\" width=\"1000\" height=\"301\" alt=\"Serverless\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/serverless-2.png 1000w, https://emolike.net/wp-content/uploads/2018/04/serverless-2-300x90.png 300w, https://emolike.net/wp-content/uploads/2018/04/serverless-2-768x231.png 768w, https://emolike.net/wp-content/uploads/2018/04/serverless-2-604x182.png 604w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" /></p>\n<p>The advantage of these services is that instead of paying a fixed monthly fee for renting a compute instance in a datacenter (typically between $5 and $50 per month), you can “pay-as-you-go” based on the number of function calls that your application receives.</p>\n<p>These services are priced by the number of function call requests per month -</p>\n<table>\n<tbody>\n<tr>\n<th></th>\n<th>AWS Lambda</th>\n<th>Google Cloud Functions</th>\n<th>Azure Functions</th>\n</tr>\n<tr>\n<td>Free Requests Per Month</td>\n<td>1 million</td>\n<td>2 million</td>\n<td>1 million</td>\n</tr>\n<tr>\n<td>Price Per Million Requests</td>\n<td>$0.20</td>\n<td>$0.40</td>\n<td>$0.20</td>\n</tr>\n</tbody>\n</table>\n<p>Each service also charges for the precise amount of CPU time used (rounded up to the nearest 100ms), but this pricing is a bit more complicated, so I’ll just refer you their respective pricing pages.</p>\n<ul>\n<li><a href=\"https://aws.amazon.com/lambda/pricing/\">AWS Lambda Pricing</a></li>\n<li><a href=\"https://cloud.google.com/functions/\">Google Cloud Compute Pricing</a></li>\n<li><a href=\"https://azure.microsoft.com/en-us/pricing/details/functions/\">Microsoft Azure Functions</a></li>\n</ul>\n<p>The quickest way to get started is to use the open-source <a href=\"https://github.com/serverless/serverless\">Serverless Framework</a>, which provides an easy way to deploy Node.js, Python, Java, and Scala functions on either of the three services.</p>\n<p>Serverless architecture has a lot of buzz right now, but <strong>I cannot personally vouch for how well it works in a production environment</strong>, so <em>caveat emptor</em>.</p>\n<h4 id=\"9usedockertohostmultiplelowtrafficappsonasinglemachine\">9. Use Docker to host multiple low-traffic apps on a single machine</h4>\n<p>Sometimes you might have multiple backend applications to run, but each without a very demanding CPU or memory footprint. In this situation, it can be an advantageous cost-cutting move to run all of the applications on the same machine instead of running each on a separate instance. This can be difficult, however, if the projects have differing dependencies (say, one requires Node v6.9 and another requires Node v8.4), or need to be run on different operating system distributions.</p>\n<p><img class=\"alignnone size-full wp-image-496\" src=\"https://emolike.net/wp-content/uploads/2018/04/docker.png\" width=\"1280\" height=\"1141\" alt=\"Docker\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/docker.png 1280w, https://emolike.net/wp-content/uploads/2018/04/docker-300x267.png 300w, https://emolike.net/wp-content/uploads/2018/04/docker-768x685.png 768w, https://emolike.net/wp-content/uploads/2018/04/docker-1024x913.png 1024w, https://emolike.net/wp-content/uploads/2018/04/docker-303x270.png 303w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /><a href=\"https://www.docker.com/\">Docker</a> is a containerization engine that provides an elegant solution to these issues. To make an application work with Docker, you can write a Dockerfile to include with the source code, specifying the base operating system and providing instructions to set up the project and dependencies. The resulting Docker container can be run on any operating system, making it very easy to consistently manage development/production environments and to avoid conflicting dependencies.</p>\n<p><a href=\"https://docs.docker.com/compose/\">Docker-Compose</a> is a tool that allows you write a configuration file to run multiple Docker containers at once. This makes it easy to run multiple lightweight applications, services, and database containers, all on the same system without needing to worry about conflicts.</p>\n<p>Ports inside each container can be forwarded to ports on the host machine, so a simple reverse-proxy configuration (<a href=\"https://www.nginx.com/resources/wiki/\">Nginx</a> is a dependable, well-tested option) is all that is required to mount each application port behind a specific subdomain or URL route in order to make them all accessible via HTTPS on the host machine.</p>\n<p>I have personally used this setup for a few of my personal projects in the past (and the present); it can save a lot of time and money if you are willing to take the time to get familiar the tools (which can, admittedly, have a steep learning curve at first).</p>\n<h4 id=\"10usecloudflarefordnsmanagementandssl\">10. Use Cloudflare for DNS management and SSL</h4>\n<p>Once you have your website/server hosted, you’ll need a way to point your domain name to your content and to serve your domain over HTTPS.</p>\n<p><img class=\"alignnone size-full wp-image-497\" src=\"https://emolike.net/wp-content/uploads/2018/04/cloudflare.png\" width=\"1280\" height=\"567\" alt=\"Cloudflare\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/cloudflare.png 1280w, https://emolike.net/wp-content/uploads/2018/04/cloudflare-300x133.png 300w, https://emolike.net/wp-content/uploads/2018/04/cloudflare-768x340.png 768w, https://emolike.net/wp-content/uploads/2018/04/cloudflare-1024x454.png 1024w, https://emolike.net/wp-content/uploads/2018/04/cloudflare-604x268.png 604w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<p><a href=\"https://www.cloudflare.com/\">Cloudflare</a> is a domain management service backed by the likes of Google and Microsoft. At its core, Cloudflare allows you to point your domain name (and subdomains) to your website server(s). Beyond this basic functionality, however, it offers lots of free features that are hugely beneficial for anyone hosting a web app or API.</p>\n<h6 id=\"benefit1security\">Benefit 1 - Security</h6>\n<p>Cloudflare will automatically protect your website from malicious traffic. Their massive infrastructure provides protection from DDoS (Distributed Denial of Service) attacks, and their firewall will protect your site from a continuously updated list of threats that are detected throughout their network.</p>\n<h5 id=\"benefit2speed\">Benefit 2 - Speed</h5>\n<p>Cloudflare will distribute your content quickly by sending it through a global CDN (content delivery network). The benefit of a CDN is that when someone visits the site, the data will be sent to them from a data center in their geographic region instead of from halfway around the world, allowing the page to load quicker.</p>\n<h5 id=\"benefit3datatransfercostsavings\">Benefit 3 - Data Transfer Cost Savings</h5>\n<p>An added benefit to using a CDN is that by sending the cached content from Cloudflare’s servers, you can reduce the bandwidth (and therefore the costs) from wherever your website is being hosted from. Cloudflare offers unlimited free bandwidth through their CDN.</p>\n<h6 id=\"benefit4freessl\">Benefit 4 - Free SSL</h6>\n<p>Best of all, Cloudflare provides a free SSL certificate and automatically serves your website over HTTPS. This is very important for security (seriously, don’t deploy a website without HTTPS), and would usually require server-side technical setup and annual fees; I’ve never seen another company (besides <a href=\"https://letsencrypt.org/\">Let’s Encrypt</a>) offer it for free.</p>\n<p>Cloudflare offers a somewhat absurd <a href=\"https://www.cloudflare.com/plans/\">free plan</a>, with which you can apply all of these benefits to any number of domain names.</p>\n<blockquote><p>A note on domain names - I don’t know of any way to score a free domain name, so you might have to pay a registration fee and an annual fee. It’s usually around $10/year, but you can get the first year for $1 or even for free if you shop around for deals. As an alternative, services like Heroku and GitHub can host your site behind their own custom subdomains for free, but you’ll lose some brand flexibility with this option. I recommend buying a single domain (such as <a href=\"http://patricktriest.com/\">patricktriest.com</a>) and deploying your apps for free on subdomains (such as <a href=\"https://blog.patricktriest.com/\">blog.patricktriest.com</a>) using Cloudflare.</p></blockquote>\n<h3 id=\"wantmorefreestuff\">Want more free stuff?</h3>\n<p>In my workflow, I also use <a href=\"https://github.com/\">Github</a> to store source code and <a href=\"https://circleci.com/\">CircleCI</a> to automate my application build/test/deployment processes. Both are completely free, of course, until you need more advanced, enterprise friendly capabilities.</p>\n<p><img class=\"alignnone size-full wp-image-498\" src=\"https://emolike.net/wp-content/uploads/2018/04/free-stuff.jpg\" width=\"500\" height=\"333\" alt=\"Free Stuff\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/free-stuff.jpg 500w, https://emolike.net/wp-content/uploads/2018/04/free-stuff-300x200.jpg 300w, https://emolike.net/wp-content/uploads/2018/04/free-stuff-405x270.jpg 405w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></p>\n<p>If you need some beautiful free images check out <a href=\"https://www.pexels.com/\">Pexels</a> and <a href=\"https://unsplash.com/\">Unsplash</a>, and for great icons, I would recommend <a href=\"http://fontawesome.io/\">Font Awesome</a> and <a href=\"https://thenounproject.com/\">The Noun Project</a>.</p>\n<p>2017 is a great year to deploy a web app. If your app is a huge success, you can expect the costs to go up proportionally with the amount of traffic it receives, but with a well-optimized codebase and a scalable deployment setup, these costs can still be bounded within a very manageable range.</p>\n<p>I hope that this post has been useful! Feel free to comment below with any other techniques and tactics for obtaining cheap web application hosting.</p>\n<hr class=\"footnotes-sep\" />\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><a href=\"https://cloud.google.com/storage/pricing#transfer-service-pricing\">https://cloud.google.com/storage/pricing#transfer-service-pricing</a> <a class=\"footnote-backref\" href=\"https://blog.patricktriest.com/host-webapps-free/#fnref1\">↩︎</a></li>\n<li id=\"fn2\" class=\"footnote-item\"><a href=\"https://aws.amazon.com/s3/pricing/\">https://aws.amazon.com/s3/pricing/</a> <a class=\"footnote-backref\" href=\"https://blog.patricktriest.com/host-webapps-free/#fnref2\">↩︎</a></li>\n<li id=\"fn3\" class=\"footnote-item\"><a href=\"https://azure.microsoft.com/en-us/pricing/details/storage/blobs-general/\">https://azure.microsoft.com/en-us/pricing/details/storage/blobs-general/</a> <a class=\"footnote-backref\" href=\"https://blog.patricktriest.com/host-webapps-free/#fnref3\">↩︎</a></li>\n</ol>\n<div id=\"at_zurlpreview\">\n<h2>10 Tips To Host Your Web Apps For Free</h2>\n<h3 style=\"display: none;\">10 Tips To Host Your Web Apps For Free</h3>\n<p class=\"imgp\"><img class=\"alignnone size-full wp-image-499\" src=\"https://emolike.net/wp-content/uploads/2018/04/webhosting-header.jpg\" width=\"1280\" height=\"448\" srcset=\"https://emolike.net/wp-content/uploads/2018/04/webhosting-header.jpg 1280w, https://emolike.net/wp-content/uploads/2018/04/webhosting-header-300x105.jpg 300w, https://emolike.net/wp-content/uploads/2018/04/webhosting-header-768x269.jpg 768w, https://emolike.net/wp-content/uploads/2018/04/webhosting-header-1024x358.jpg 1024w, https://emolike.net/wp-content/uploads/2018/04/webhosting-header-604x211.jpg 604w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<p class=\"imgd\">A guide to navigating of the competitive marketplace of web hosting companies and cloud service providers.</p>\n<p class=\"imgs\">Source: <a href=\"https://blog.patricktriest.com/host-webapps-free/\" target=\"_blank\" rel=\"noopener\">blog.patricktriest.com/host-webapps-free/</a></p>\n</div>\n</section>\n</div>\n</section>\n", "slug": "10-tips-to-host-your-web-apps-for-free", "date": 1525015605, "cats": [0, 1, 11, 24, 15]}