{"title": "12+ Lightweight CSS Frameworks to Build a Blazing Fast Website", "content": "<p align=\"justify\">When it comes to building a website, <a href=\"https://getbootstrap.com/\" target=\"_blank\" rel=\"nofollow noopener\">Bootstrap</a>, <a href=\"https://foundation.zurb.com/\" target=\"_blank\" rel=\"nofollow noopener\">Foundation</a> and <a href=\"https://semantic-ui.com/\" target=\"_blank\" rel=\"nofollow noopener\">Semantic UI</a> are probably the three frameworks that come to your mind. However, all these frameworks are relatively heavy and require a deep understanding of the core. Particularly when you’re working on a light project, using a lightweight CSS framework can do the job effectively by cutting down all the bloat and providing you just enough features to help you get started quickly.</p>\n<p align=\"justify\">With that in mind, we’ve researched and compiled a list of 12+ minimal and lightweight CSS frameworks that you may not have even heard about but can use to create beautiful, functional and insanely fast loading websites in no time. All these frameworks require a fairly steep learning curve and ship with just what you actually need to kickstart your next web project.</p>\n<p><strong>So, let’s check them out now!</strong></p>\n<h2>#<a href=\"https://mustard-ui.com/\" target=\"_blank\" rel=\"nofollow noopener\">Mustard UI</a>:</h2>\n<p align=\"justify\">An open-source, lightweight and exceptionally beautiful starter CSS framework to build amazingly fast websites in less time! Mustard includes a directory structure that splits the framework into modules aka building blocks, allowing you to selectively exclude or include CSS components into your project. Even, with a single click of the mouse, you can pull in everything to your project. Powered by the <a href=\"https://www.w3schools.com/Css/css3_flexbox.asp\" target=\"_blank\" rel=\"nofollow noopener\">CSS Flexbox</a>, Mustard UI comes with everything needed for a stunning front-end design.</p>\n<p><strong>Size:</strong> 5.3kb</p>\n<h2>#<a href=\"http://getmobicss.com/\" target=\"_blank\" rel=\"nofollow noopener\">Mobi.css</a>:</h2>\n<p align=\"justify\">Mobi.css is a lightweight, scalable, and mobile-first CSS framework designed to help you build clean, elegant and content-rich web pages quickly and easily. What makes the framework great and scalable is the plug-in and theme system. In addition to enhancing Mobi.css, any plug-in can even be used as a standalone CSS library. Although Mobi.css is designed with mobile in mind, it also works quite well for desktop devices.</p>\n<p><strong>Size:</strong> 2.6kb</p>\n<h2>#<a href=\"https://siimple.juanes.xyz/\" target=\"_blank\" rel=\"nofollow noopener\">Siimple</a>:</h2>\n<p align=\"justify\">Siimple is a flexible, beautiful and minimal front-end CSS framework that can be used as the foundation to build flat and clean websites. Built on the top of SASS/SCSS mixins, it has an ultra-clean codebase with only a small number (around 250) of code lines. Supported by the latest versions of almost all mobile and web browsers, Siimple provides developers a clean starting point for their web designs.</p>\n<p><strong>Size:</strong> 6kb</p>\n<h2>#<a href=\"http://beauter.outboxcraft.com/\" target=\"_blank\" rel=\"nofollow noopener\">Beauter</a>:</h2>\n<p align=\"justify\">Based on an experimental design methodology BOL, Beauter is a minimal yet powerful CSS framework for building faster and beautiful responsive websites. This is an extremely lightweight framework; however, it doesn’t inevitably mean that the framework is not packed with all the essential elements. From the basic elements like a responsive grid to advanced elements like parallax scrolling, Beauter offers you almost everything to make your web development cleaner and faster than ever.</p>\n<p><strong>Size:</strong> 6kb</p>\n<h2>#<a href=\"https://milligram.io/\" target=\"_blank\" rel=\"nofollow noopener\">Milligram</a>:</h2>\n<p align=\"justify\">As the name explains itself, Milligram is a simple, lightweight and minimal CSS framework built with three crucial things in mind: cleaner code, better performance, and higher productivity. Offering a minimal setup of styles, it provides developers with a clean and fast start. While Milligram is not designed to work with old browsers, it still supports some old versions of popular browsers. It works on top of <a href=\"https://necolas.github.io/normalize.css/\" target=\"_blank\" rel=\"nofollow noopener\">Normalize</a> and can be installed using any of the popular package managers such as Bower, Yarn or NPM.</p>\n<p><strong>Size:</strong> 2kb</p>\n<h2>#<a href=\"https://picturepan2.github.io/spectre/\" target=\"_blank\" rel=\"nofollow noopener\">Spectre</a>:</h2>\n<p align=\"justify\">Lightweight, modern and responsive, Spectre is a CSS framework for easier, faster and extensible front-end web development. It provides everything you need to make your web design exceptional, including modern base styles for typography and elements, pure CSS components and utilities, and a Flexbox-based, responsive and mobile-friendly layout system. Spectre.css is completely free to use and can be installed manually, from CDN or using popular package managers.</p>\n<p><strong>Size:</strong> 10kb</p>\n<h2>#<a href=\"http://getbase.org/\" target=\"_blank\" rel=\"nofollow noopener\">Base</a>:</h2>\n<p align=\"justify\">Built on top of the latest Normalize.css, Base is a robust, semantic and extensible responsive CSS framework designed to let you focus less on overriding styles and more on creating cross-browser compatible, mobile-first website applications. The framework is split into independent modules so you can include only the ones you actually need in your project. Moreover, it is packed with a GulpJS config to automate your website development workflow.</p>\n<p><strong>Size:</strong> 2kb</p>\n<h2>#<a href=\"https://minicss.org/\" target=\"_blank\" rel=\"nofollow noopener\">Mini.css</a>:</h2>\n<p align=\"justify\">Mini.css is a responsive, minimal and style-agnostic CSS framework to build websites that look beautiful and load fast on all kind of mobile and desktop devices. Providing as much functionality as possible in a very small footprint, Mini.css bridges the gap between fully-featured frameworks like Bootstrap and Foundation) and micro frameworks (such as Beauter and Milligram). As it relies solely on CSS, you need not worry about having any conflicts with other JS libraries you might be using.</p>\n<p><strong>Size:</strong> 7kb</p>\n<h2>#<a href=\"https://bulma.io/\" target=\"_blank\" rel=\"nofollow noopener\">Bulma</a>:</h2>\n<p align=\"justify\">Built with Flexbox, Bulma is an easy to learn, simple to use and quick to customize open source CSS framework built with a mobile-first approach in mind. Every single element in this framework is not only well-optimized for vertical reading on small screen devices but also can be easily customized to fit your specific project requirements. What’s more, the entire framework is divided into 39.sass files which you can import individually to your project.</p>\n<p><strong>Size:</strong> 21kb</p>\n<h2>#<a href=\"http://www.pavilion.io/\" target=\"_blank\" rel=\"nofollow noopener\">Pavilion</a>:</h2>\n<p align=\"justify\">Pavilion is simple, lightweight and highly customizable CSS framework particularly built for developers who never want to use the countless pre-defined UI components which most of the CSS framework usually ship with. Packed with a versatile fully responsive grid system, SCSS variables, Gulp, and several handy tools and utilities to speed up your web development, Pavilion is definitely a great CSS starting point without the bloat.</p>\n<p><strong>Size:</strong> 7kb</p>\n<h2>#<a href=\"https://www.cutestrap.com/\" target=\"_blank\" rel=\"nofollow noopener\">Cutestrap</a>:</h2>\n<p align=\"justify\">Designed to cut down on repetitive tasks as well as to reduce the overall development time, Cutestrap is a tiny alternative to full-blown frameworks such as Bootstrap and Foundation. Taking advantage of the BEM methodology for naming conventions, it facilitates you great CSS organization. Just because Cutestrap has a very small file size, it doesn’t mean it is just a blank starter template. Rather it comes bundled with an implicit Flexbox-based grid, beautiful and consistent form controls, a color palette, a choice of typefaces and much more.</p>\n<p><strong>Size:</strong> 8kb</p>\n<h2>#<a href=\"https://vitalcss.com/\" target=\"_blank\" rel=\"nofollow noopener\">Vital</a>:</h2>\n<p align=\"justify\">Billed as the “reverse approach” to all the heaviest frameworks out there, Vital is a lightweight, flexible and scalable CSS framework to design modern websites and applications. Built using Sass with the principal ‘less is more’, this minimally invasive framework is written almost entirely in em values to provide easy and consistent scaling on all devices. Reducing workflow inefficiencies to the maximum extent possible, Vital saves the time you spend on coding and allows you to focus on the most vital features of your project.</p>\n<p><strong>Size:</strong> 6kb</p>\n<h2>Some Other Popular Lightweight CSS Frameworks That Are Worth Trying Out</h2>\n<ul>\n<li><strong><a href=\"https://purecss.io/\" target=\"_blank\" rel=\"nofollow noopener\">Pure</a>:</strong> A set of small, responsive CSS modules | <strong>Size:</strong> 3.8kb</li>\n<li><strong><a href=\"https://picnicss.com/\" target=\"_blank\" rel=\"nofollow noopener\">Picnic CSS</a>:</strong> A lightweight and beautiful CSS library built on the top of Normalize.css | <strong>Size:</strong> Under 10kb</li>\n<li><strong><a href=\"https://www.muicss.com/\" target=\"_blank\" rel=\"nofollow noopener\">MUI</a>:</strong> A lightweight CSS framework based on Google’s Material Design | <strong>Size:</strong> 6kb</li>\n<li><strong><a href=\"http://cardinalcss.com/\" target=\"_blank\" rel=\"nofollow noopener\">Cardinal</a>:</strong> A modular, scalable, mobile-first CSS framework | <strong>Size:</strong> 12kb</li>\n<li><strong><a href=\"http://furtive.co/\" target=\"_blank\" rel=\"nofollow noopener\">Furtive</a>:</strong> A truly mobile-first CSS micro-framework | <strong>Size:</strong> 2.47kb</li>\n<li><strong><a href=\"http://labs.jerryjappinen.com/layers/\" target=\"_blank\" rel=\"nofollow noopener\">Layers</a>:</strong> A lightweight, unobtrusive and style-agnostic CSS framework | <strong>Size:</strong> 8kb</li>\n<li><strong><a href=\"http://goatslacker.github.io/lotus.css/\" target=\"_blank\" rel=\"nofollow noopener\">Lotus</a>:</strong> An insanely tiny yet extremely powerful CSS library | <strong>Size:</strong> 1.8kb</li>\n<li><strong><a href=\"https://mildrenben.github.io/surface/\" target=\"_blank\" rel=\"nofollow noopener\">Surface</a>:</strong> A super lightweight, CSS only framework based on Google’s Material Design | <strong>Size:</strong> 5.7kb</li>\n<li><strong><a href=\"https://jenil.github.io/chota/\" target=\"_blank\" rel=\"nofollow noopener\">Chota</a>:</strong> A super lightweight, micro CSS framework | <strong>Size:</strong> 3kb</li>\n<li><a href=\"http://rmmfree.github.io/shine_css/\" target=\"_blank\" rel=\"nofollow noopener\"><strong>Shine</strong></a><strong>:</strong> A simple and lightweight CSS framework | <strong>Size:</strong> 5.7kb</li>\n</ul>\n<p>source : <a href=\"http://www.creativeweblogix.com/blog/12-lightweight-css-frameworks\">http://www.creativeweblogix.com/blog/12-lightweight-css-frameworks</a></p>\n", "slug": "12-lightweight-css-frameworks-to-build-a-blazing-fast-website", "date": 1540637790, "cats": [36, 18, 14]}