{"title": "3 Leading Enterprise Low-Code App Development Platforms Compared", "content": "<p>It&#8217;s no secret that enterprise mobile and Web app development is being transformed by a new class of tools enabling non-programming “citizen developers” to meet the insatiable demand for apps amid a shortage of coding pros.</p>\n<p>These tools have many names &#8212; such as rapid-application development (RAD), low-code and even no-code &#8212; but they typically feature functionality such as model-driven development, point-and-click programming, drag-and-drop composability, wizard-based workflows and similar techniques.</p>\n<p>In comparing the top tools, we&#8217;ll go with the term “low-code,” used by Forrester Research Inc. for a series of “Forrester Wave” research reports, such as <a href=\"https://adtmag.com/articles/2016/04/14/low-code-tools.aspx\" target=\"_self\">this one</a> published last year. Another major research firm, Gartner Inc., recently chimed in with its own study of the tools. Gartner calls them “Enterprise High-Productivity Application Platform as a Service” (hpaPaaS), though its new “Magic Quadrant” <a href=\"https://adtmag.com/articles/2017/05/12/gartner-low-code.aspx\" target=\"_self\">report</a> on that space uses “low-code” and “no-code” and “RAD” terminology liberally. The firm examined cloud-hosted solutions only.</p>\n<figure><img class=\"alignnone wp-image-108\" src=\"https://emolike.net/wp-content/uploads/2018/03/lowcode_graphic_s.png\" alt=\"The Gartner and Forrester Reports, Respectively\" width=\"652\" height=\"311\" srcset=\"https://emolike.net/wp-content/uploads/2018/03/lowcode_graphic_s.png 300w, https://emolike.net/wp-content/uploads/2018/03/lowcode_graphic_s-200x95.png 200w\" sizes=\"(max-width: 652px) 100vw, 652px\" /><figcaption><b>[Click on image for larger view.]</b>The Gartner and Forrester Reports, Respectively <em>(source: Gartner and Forrester)</em></figcaption></figure>\n<p>Both reports feature a “Leaders” category in their reports, and the only companies that were deemed Leaders by both firms were Salesforce.com Inc., OutSystems Inc. and Mendix Inc. Following is a comparison of the three low-code platforms offered by these leaders.</p>\n<p><span class=\"a12blub\"><b>Salesforce.com</b></span></p>\n<figure><img class=\"alignnone wp-image-109\" src=\"https://emolike.net/wp-content/uploads/2018/03/salesforce_app_cloud_s.png\" alt=\"Salesforce App Cloud\" width=\"627\" height=\"351\" srcset=\"https://emolike.net/wp-content/uploads/2018/03/salesforce_app_cloud_s.png 300w, https://emolike.net/wp-content/uploads/2018/03/salesforce_app_cloud_s-200x112.png 200w\" sizes=\"(max-width: 627px) 100vw, 627px\" /><figcaption><b>[Click on image for larger view.]</b>Salesforce App Cloud <em>(source: Salesforce)</em></figcaption></figure>\n<p>Although the company made its reputation as a CRM software vendor, its Force.com “high-productivity application platform service” has been on the scene since 2008. Now, Force.com and similar services are provided under the company&#8217;s <a href=\"https://developer.salesforce.com/mobile\" target=\"_blank\" rel=\"noopener\">App Cloud Mobile</a> platform.</p>\n<p>It provides a Mobile SDK that can be used to create native Android, iOS and Windows apps that can be deployed via the company&#8217;s Salesforce1 product. Developers can use the company&#8217;s <a href=\"https://www.heroku.com/\" target=\"_blank\" rel=\"noopener\">Heroku</a> cloud application platform offering to design and operate scalable back-end services.</p>\n<p>And the nearly 10-year-old <a href=\"https://developer.salesforce.com/platform/force.com\" target=\"_blank\" rel=\"noopener\">Force.com</a> is still at the heart of the offering, providing app development even simpler than the low-code approach, being described as no-code.</p>\n<p>“Force.com is the only platform that lets you build powerful enterprise applications without writing a line of code,” the company says. “You can create apps by dragging and dropping components into the <a href=\"https://trailhead.salesforce.com/en/modules/lightning_app_builder\" target=\"_blank\" rel=\"noopener\">Lightning App Builder</a>. Automate business processes with the Lightning Process Builder and modify your data object relationships with the Schema Builder.”</p>\n<p>With these and complementary products and services all under the App Cloud Mobile platform, Salesforce said that platform provides:</p>\n<ul>\n<li>Security: Built-in identity and security features include user identity, two-factor authentication, encrypted offline database, and transaction security policies to ensure safe usage without impacting user experience.</li>\n<li>Data Integration: Easily bring rich, contextual data to any mobile app from any data source like Oracle databases, SQL Server, SAP, etc. &#8212; whether it&#8217;s using reference-based point and click integration patterns to your existing enterprise systems or streaming event data from connected devices at scale &#8212; all with the trust of Salesforce and unified, consistent REST APIs.</li>\n<li>Scalability: App Cloud Mobile offers massive scalability based on elastic and multi-tenant infrastructure. With just a few clicks, IT teams can now deploy mobile apps to thousands of employees and millions of consumers across the globe.</li>\n</ul>\n<p>In a <a href=\"https://www.salesforce.com/blog/2016/06/leading-the-low-code-revolution.html\" target=\"_blank\" rel=\"noopener\">blog post</a>, the company said “By empowering citizen developers in every part of the business, all of them modifying and adapting their own work rather than waiting for innovation to be handed down, change will happen constantly and smoothly rather than in uncomfortable lurches. The low-code revolution is really about setting the pace of change and making everyone an active participant.”</p>\n<p><b>Forrester&#8217;s Take:</b> “Salesforce is the biggest vendor of low-code application platforms, with an estimated $600 million to $700 million in annual revenue from its development platforms alone,” Forrester said. “Force.com, the Community Cloud, and the Lightning platform anchor this low-code customer base, although Salesforce also has platforms (Heroku), tools (Force.com IDE), and partnerships (with continuous-delivery tool vendors) that address coders.”</p>\n<p>Forrester said the company&#8217;s greatest strength is its feature set that enables users to supplement customer data managed by Salesforce&#8217;s software-as-a-service (SaaS) apps. The researh firm also noted Salesforce&#8217;s security certifications and strong partner roster of other companies and developers.</p>\n<p>The company&#8217;s greatest weakness as identified by Forrester, however, directly contradicts Salesforce&#8217;s own “without writing a line of code” claim for its Force.com offering.</p>\n<p>“Salesforce&#8217;s primary weakness is, ironically, its reliance on code-centric development-process support and deployment,” Forrester said. “It is not as &#8216;low code&#8217; as some of the other choices. In addition, this platform lacks customer control over application autoscaling, has no option to install the environment on-premises, and relies on code-centric approaches for custom mobile applications.”</p>\n<p><b>Gartner&#8217;s Take:</b> “Salesforce is a pioneer of cloud computing, having introduced a general-purpose, high-productivity application platform service (Force.com) in 2008,” Gartner said. “Salesforce&#8217;s popular SaaS offerings and early commitment to cloud computing generated momentum and market presence for Force.com. Salesforce&#8217;s aPaaS offering is App Cloud, which includes Force.com and the Heroku high-control aPaaS, although the latter has only secondary impact on Salesforce&#8217;s position in this Magic Quadrant.”</p>\n<p>“The Force.com platform implements shared-everything elasticity to deliver fully cloud-native operation of process and data management,” Gartner continued. “The core offering consists of a new composable user experience development platform (Lightning), a high-productivity Web-based application development platform (Visualforce), and a fourth-generation language (Apex) for more advanced back-end functionality. Execution is entirely by metadata interpretation.”</p>\n<p>Gartner identified several strengths of the Salesforce offering, including its well-established position in the market and the recent move to the Amazon Web Services Inc. (AWS) cloud. Under the Cautions heading, Gartner mentioned the company&#8217;s proprietary nature that enhances some aspects of its offerings but also entails vendor lock-in. Other concerns included the high cost of App Cloud and that the company&#8217;s “long-standing mantra of &#8216;no software&#8217; now hinders its adoption for the IoT as that requires some components be local to devices &#8212; off-cloud.”</p>\n<p><span class=\"a12blub\"><b>OutSystems</b></span></p>\n<figure><img class=\"alignnone wp-image-110\" src=\"https://emolike.net/wp-content/uploads/2018/03/outsystems_low_code_s.png\" alt=\"The OutSystems Low-Code Approach\" width=\"618\" height=\"379\" srcset=\"https://emolike.net/wp-content/uploads/2018/03/outsystems_low_code_s.png 300w, https://emolike.net/wp-content/uploads/2018/03/outsystems_low_code_s-200x123.png 200w\" sizes=\"(max-width: 618px) 100vw, 618px\" /><figcaption><b>[Click on image for larger view.]</b>The OutSystems Low-Code Approach <em>(source: OutSystems)</em></figcaption></figure>\n<p>While the Salesforce approach is somewhat piecemeal, the Atlanta-based OutSystems puts all of its low-code eggs in one drag-and-drop development environment basket, the latest version of which is the <a href=\"https://www.outsystems.com/platform/\" target=\"_blank\" rel=\"noopener\">OutSystems 10 platform</a>. With it, developers can define a data model, business logic, workflow processes and UIs for mobile and Web apps.</p>\n<p>The company emphasizes its support of offline functionality and access to native device functionality. While app components are simply dragged onto a work surface and connected visually, developers can extend app functionality by writing or using custom code in languages such as C#, Java, SQL, HTML, CSS and JavaScript.</p>\n<p>The platform reportedly can be integrated with “any” system, and apps can be deployed with one-click &#8212; including mobile app deployment to the major stores.</p>\n<p>While Gartner discussed vendor lock-in with the Salesforce offering, OutSystems boasts that its platform is an open, standards-based solution with no such lock-in, proprietary data models or proprietary runtime.</p>\n<p>Here is a capsule summation of the company&#8217;s approach to “avoiding the pitfalls of rapid application development”:</p>\n<blockquote><p><i>The OutSystems architecture avoids the pitfalls of old fourth-generation language (4GL) technologies. The visual DSL was defined to be expressive enough for the broad scope of logic required for complex enterprise applications. It was also designed to be open and extensible, allowing developers to plug in custom code or pre-built extensions.</i></p>\n<p>Instead of promoting it as &#8216;code free,&#8217; we designed the OutSystems visual language from the start to be a layer on top of existing coding skills, and it actually promotes the graceful &#8216;stepdown&#8217; to standard 3GL languages such as C#, JavaScript, SQL, and CSS whenever it makes sense. The goal is not to push developers away from coding; instead it just adds on what developers already know so they become extremely productive, stay in control and avoid the risk of &#8216;hitting a brick wall.&#8217;</p></blockquote>\n<p><b>Forrester&#8217;s Take:</b> “The vendor&#8217;s strong performance in our analysis reflects its strong commitment enterprise customers and to low-code tooling for all aspects of application development, delivery, and maintenance,” Forrester said in its Wave report. “OutSystems Platform&#8217;s greatest strengths are its broad features and tools for database and process applications, mobile and Web user experiences, integration, and collaboration. Customers will find few gaps that require them to code, even when working on integration and custom user experiences &#8212; the usual trouble spots for low-code platforms. OutSystems makes it free and easy for customers to get started with its platform.”</p>\n<p>The research firm identified OutSystems&#8217; primary weakness as a reliance on others &#8212; either partners or customers &#8212; to provide major cloud-security certifications. Also, being a medium-sized private vendor, OutSystems might seem a risky choice to some global organizations, Forrester said.</p>\n<p><b>Gartner&#8217;s Take:</b> “OutSystems offers a RAD hpaPaaS solution that focuses on accelerating the &#8216;time to solution&#8217; of enterprise apps,” Gartner said. “It is one of the better-known and more-established providers in the market today. The OutSystems platform uses an indirectly executed metadata-driven model &#8212; that is, the metadata model is used to generate .NET C# or Java code, which ultimately drives the execution of the application. Applications are developed using an extensible, no-code visual integrated development environment (IDE; known as Service Studio) and deployed on-premises, or in a private or public cloud (AWS or Azure), using a DevOps tool (LifeTime). Applications are usable with Web and mobile client devices. OutSystems has customers in 43 countries and has more than 180 partners.”</p>\n<p>Under Cautions, Gartner said “Customers choosing to discontinue their use of OutSystems and generate standard C# or Java code for traditional development, should recognize that modifying the generated code breaks the synchronization to the source metadata model should they return to OutSystems&#8217; IDE in future.” It also cited some limitations of OutSystems&#8217; Web IDE when compared to its desktop counterpart, some customers&#8217; views that the company could provide better technical support and documentation, and more widespread concerns about pricing, which was characterized as “only fair, or worse.”</p>\n<p><span class=\"a12blub\"><b>Mendix</b></span></p>\n<figure><img class=\"alignnone wp-image-111\" src=\"https://emolike.net/wp-content/uploads/2018/03/mendix_low_code_s.png\" alt=\"Mendix Platform Overview\" width=\"609\" height=\"471\" srcset=\"https://emolike.net/wp-content/uploads/2018/03/mendix_low_code_s.png 300w, https://emolike.net/wp-content/uploads/2018/03/mendix_low_code_s-200x155.png 200w\" sizes=\"(max-width: 609px) 100vw, 609px\" /><figcaption><b>[Click on image for larger view.]</b>Mendix Platform Overview <em>(source: Mendix)</em></figcaption></figure>\n<p>Mendix emphasizes the collaborative development capabilities of its namesake <a href=\"https://www.mendix.com/application-platform-as-a-service/\" target=\"_blank\" rel=\"noopener\">platform</a>, which provides model-driven creation of data models, logic, and UIs, rapid Web-based prototyping and a WYSIWYG Page Editor. That collaboration, the company says, comes into play with social interactions, agile project management, team development and feedback management.</p>\n<p>Like OutSystems, the company also noted its “openness,” with open standards (including the underlying <a href=\"https://www.cloudfoundry.org/\" target=\"_blank\" rel=\"noopener\">Cloud Foundry</a> platform), open models and open data (OData, SQL). It also provides APIs for platform extensibility, and apps can be extended with code written in JavaScript, Java and Scala. Also, the platform&#8217;s UI Framework is open source and hosted on <a href=\"https://github.com/Remcovh/mendix-ui-framework\" target=\"_blank\" rel=\"noopener\">GitHub</a>.</p>\n<p>The Mendix platform provides ready-make themes, navigation layouts, page templates and design elements.</p>\n<p>The company listed the following five principles architected into its platform:</p>\n<ul>\n<li>Achieve unprecedented time to value.</li>\n<li>Create apps that exceed user expectations.</li>\n<li>Go fast without sacrificing control.</li>\n<li>Employ openness at every level.</li>\n<li>Gain new insights with Smart Apps.</li>\n</ul>\n<p>The reference to Smart Apps concerns modern multi-channel applications being developed in the age of Big Data, the Internet of Things (IoT) and machine learning. Rather than just awaiting input from users, Smart Apps, the company said, are: intelligent (they provide recommendations and guidance to users); proactive (they predict upcoming events and trigger workflows that guide users); and contextual (personalized, location-aware and embedded in user processes).</p>\n<p><b>Forrester&#8217;s Take:</b> “Mendix is notable as the only vendor in this set to base its product on the Cloud Foundry platform, giving it intriguing opportunities to partner with large distributors of that technology to drive enterprise adoption,” Forrester said. “The Mendix platform&#8217;s greatest strengths are its incorporation of Agile and continuous delivery methods and its ability to support database and process applications, mobile and Web user experiences, integration, and collaboration. It makes extensive use of declarative tooling to create and deliver applications. Mendix also offers a generous free-access program to help customers get started with the platform.”</p>\n<p>The most glaring of the platform&#8217;s few functional weaknesses is, as with OutSystems, a lack of security certifications, for which it too depends on cloud-platform partners, Forrester said. The research firm also cited the company&#8217;s size as a possible turn-off to some global enterprise customers, though it counts such organizations among its approximately 500 customers.</p>\n<p><b>Gartner&#8217;s Take:</b> “Mendix is a well-established and fast-growing pure-play aPaaS provider,” Gartner said. “Although it initially offered an on-premises RAD platform, most of its business is now in the cloud. The Mendix Modeler is a high-productivity, model-driven visual development environment generating metadata that is interpreted at run time.”</p>\n<p>Contradicting the Forrester report, Gartner noted Mendix&#8217;s “worldwide presence, with strengthening name recognition” as a strength and said it had more than 600 paying customers (the Garner report was published about a year after the Forrester report).</p>\n<p>Furthermore, Gartner said, “Mendix&#8217;s no-code modeling tool supports sophisticated data-driven and process-oriented applications. It can generate mobile apps with offline support, as well as client-agnostic &#8216;headless&#8217; service implementations. Mendix Runtime is natively event-driven (and partly based on Akka). This helps the company support IoT and high-volume transaction processing (hundreds of thousands of concurrent transactions) for some large financial applications. The recently introduced self-service control and configuration of high availability (when deployed on AWS), together with the ability to augment metadata models with Java, JavaScript or Scala, targets the more advanced enterprise deployments. There is also a Mendix App Store &#8212; offering a venue for partners and users to share applications, widgets and services &#8212; featuring hundreds of prebuilt components and applications.”</p>\n<p>Under Cautions, Gartner listed a lack of C# support as a language for server-side extensions and only a JavaScript SDK for the client side, which might be a deterrent to Microsoft-native adoption. Gartner also warned Mendix could be an attractive target for a corporate acquisition and cited growing challenges from large competitors such as Google, Microsoft, Oracle and so on. Also, Gartner said, “Mendix is growing fast, but is not yet profitable. Reinvesting income, instead of showing a profit, is a common strategy for aggressively growing companies, but it makes Mendix more reliant on venture capital. This dependence on investors may create pressure to show a profit, cutting short the time it has to innovate and compete.”</p>\n<p>source : https://adtmag.com/blogs/dev-watch/2017/05/low-code-tools.aspx?m=1</p>\n", "slug": "3-leading-enterprise-low-code-app-development-platforms-compared", "date": 1520795686, "cats": [13, 14]}