{"title": "async/await - What You Should Know", "content": "<h2>Introduction</h2>\n<p>Sometimes, we use new technologies while we are not aware of the bottlenecks and weird parts of that technology which eventually might trap us in bad situations like deadlocks which may be really hard to track. What exactly happens in Task-based Asynchronous Pattern (TAP), what are the improvements since .NET 4.0, how may we introduce a deadlock and how to prevent it?</p>\n<p>Consider somewhere in your code, you need to do something asynchronous, what are the different ways to do it? Here are some of the patterns:</p>\n<ul>\n<li>Asynchronous Programming Model (APM): This model is also called <code>IAsyncResult</code> pattern where asynchronous operations require <code>Begin</code> and <code>End</code> methods. You are responsible to call <code>Begin</code> method of that operation and somewhere else pool for the completion/cancellation status and finally call <code>End</code>method to retrieve the actual result of that operation. It is possible to define a callback function so when the operation is done, your callback function is called or you can block your execution until the result is ready. This pattern is not recommended in the new development, please keep it in mind.</li>\n<li>Event-based Asynchronous Pattern (EAP): This type of async programming was introduced in .NET 2.0 and is not recommended in the new development. In this model, you need to have event handler delegate types and <code>EventArg</code>-derived types and in some scenarios, a worker thread to handle the async job and when it is finished, signal the parent about completion of the job.</li>\n<li>TAP model: We will discuss it in this article.</li>\n</ul>\n<p>In the above patterns, you may easily end-up with lots of worker threads that are consuming your resources or in the worse case, you may face a hard time to manage sequence of events and execution process.</p>\n<p>But, what about a way to somehow code synchronous but execute it asynchronous? Just leave the hard part to the compiler to make it happen for us?</p>\n<h2>async/await</h2>\n<h3>What Does async/await Exactly Do?</h3>\n<p>Whenever you declare or see a function as <code>async</code>, it means that this function is wait able and you can call it asynchronously using <code>await</code><strong> </strong>keyword. As soon as compiler sees the <code>await</code> keyword, it does the magic for us and immediately returns to the calling function without the need to wait for the job to be completed and the execution would be able to continue its job.</p>\n<p>It sounds great, isn’t it?</p>\n<p><img class=\"alignnone size-full wp-image-1128\" src=\"https://emolike.net/wp-content/uploads/2018/11/async1.png\" width=\"785\" height=\"605\" alt=\"\" srcset=\"https://emolike.net/wp-content/uploads/2018/11/async1.png 785w, https://emolike.net/wp-content/uploads/2018/11/async1-300x231.png 300w, https://emolike.net/wp-content/uploads/2018/11/async1-768x592.png 768w, https://emolike.net/wp-content/uploads/2018/11/async1-350x270.png 350w\" sizes=\"(max-width: 785px) 100vw, 785px\" /></p>\n<p>Here is the explanation:</p>\n<ol>\n<li>The <code>doTheJob()</code> is called (this is our initial step).</li>\n<li>The function executes synchronously until it reaches the <code>await</code> keyword in <code>doSomethingASync()</code> where the asynchronous task is returned.</li>\n<li>A new <code>Task</code> is created on-the-fly and starts to execute asynchronously and the continuation is scheduled at this point to run the remainder of the code in <code>doTheJob()</code>.</li>\n<li>The execution continues in the “anounymous-task” function until it reaches to “<code>return</code>” and continues in the “<code>doTheJob()</code>” synchronously up to “<code>return</code>”.</li>\n<li>The execution of this function is done too and the <code>Task</code> which is returned by <code>doTheJob()</code> is completed and any possible continuations registered with it may now be scheduled.</li>\n</ol>\n<p>It seems a little weird but it is actually simple to understand. as you may have already noticed, although your code seems to be very similar to synchronous programming, but in fact it is going to be executed in an <code>async</code>way. You can simply await for a “time consuming” task and leave it there to be completed and schedule your execution once it is done!</p>\n<h3>What is the Benefit?</h3>\n<ul>\n<li>Your synchronous style of coding would be executed asynchronously , that’s the magic (of course with the help of <code>async</code>/<code>await</code> and <code>Task.Run</code> in this article for example)</li>\n<li>You won’t be worried anymore about lots of event pooling/checking, thread synchronizations and tough situations you experienced before just to handle multi-threaded asynchronous approaches.<br />\nOf course, you still have to understand asynchronous programming and how to synchronous any shared state, which means there’s still the potential for race conditions, deadlocks, starvation, etc. as you may find in this article. (See the “What is the <code>ConfigureAwait()</code> for”)</li>\n<li>Your code is more readable, understandable and thus debug able.</li>\n</ul>\n<h3>What is the Difference with ContinueWith() in .NET 4.0?</h3>\n<p>Actually, the <code>async</code>/<code>await</code> is a replacement of their successor “<code>ContinueWith()</code>” which was introduced in NET 4.0. Each approach has its pros and cons.</p>\n<ul>\n<li><code>ContinueWith</code> is ignorance of sync context</li>\n<li><code>ContinueWith</code> pushes you to a new thread, even if the parent is already complete</li>\n<li>Access <code>.Result</code> on a faulted <code>Task</code> inside of <code>ContinueWith</code> will re-throw</li>\n<li><code>Async</code>/<code>await</code> will try to keep you on the same thread if they can</li>\n</ul>\n<p>So upgrade to .NET 4.5 and use <code>async</code> and <code>await</code>…</p>\n<h3>What is the ConfigureAwait() for?</h3>\n<p>It was introduced since .NET 4.5 because of some deadlock situation which may happen in accordance with a bad code structure. Consider the following diagram:</p>\n<p><img class=\"alignnone size-full wp-image-1129\" src=\"https://emolike.net/wp-content/uploads/2018/11/async2.png\" width=\"648\" height=\"542\" alt=\"\" srcset=\"https://emolike.net/wp-content/uploads/2018/11/async2.png 648w, https://emolike.net/wp-content/uploads/2018/11/async2-300x251.png 300w, https://emolike.net/wp-content/uploads/2018/11/async2-323x270.png 323w\" sizes=\"(max-width: 648px) 100vw, 648px\" /></p>\n<p>What happened? Did you get it?</p>\n<ol>\n<li>When you awaitened in <code>Fn2()</code>, it actually moved the <code>f()</code> execution into another context with its thread pool and the rest of <code>Fn2()</code> was wrapped to be executed after the <code>f()</code> call is done.</li>\n<li>The execution control returned to <code>Fn1()</code> and continued until it reached out to a <strong>Blocking</strong> wait. Here is the point. (<em>You actually blocked “Context a” execution process for another async operation to be completed)</em></li>\n<li>As soon as <code>async</code> operation in “<code>Context b</code>” is completed, it tries to get access to “<code>Context a</code>” just to inform it that “execution is done, let’s continue with the wrapped part”.</li>\n<li>But, “<code>Context a</code>” is blocked before!</li>\n<li>Deadlock!</li>\n</ol>\n<p>There are two approaches for that:</p>\n<ul>\n<li>Never use any kind of blocking waits and instead use <code>WhenAll</code> or <code>When</code><strong> </strong>functions to wait for a task to be completed and continue after completion.</li>\n<li>Allow <u>wrapped content</u> to be executed in “<code>Context b</code>“.</li>\n</ul>\n<p>For the second approach, you need to somehow configure the <code>await</code><strong> </strong>keyword to be aware of that! So you need to call <code>ConfigureAwait(false)</code> so the compiler would know that the wrapped content must be executed in the <code>async</code> context and there is no need to return back to calling context just to continue wrapped content!</p>\n<p>continue reading in Codeproject :</p>\n<p><a href=\"https://www.codeproject.com/Articles/1054993/async-await-What-You-Should-Know-Updated\">https://www.codeproject.com/Articles/1054993/async-await-What-You-Should-Know-Updated</a></p>\n", "slug": "async-await-what-you-should-know", "date": 1543240696, "cats": [0, 13, 14, 17, 15]}