{"title": "Dependency injection for beginners", "content": "<p>You’re in the car business, your job is to make cars on-demand. The object-oriented programmer in you says: “no problem, I’ll make a blueprint that I can use to make as much cars as I want!”.</p>\n<pre><code data-enlighter-language=\"null\">class Car\r\n{\r\n    public function drive()\r\n    {\r\n        // ...\r\n    }\r\n}</code></pre>\n<p>For this car to work, it needs an engine and wheels. Now, there are several approaches to achieve that goal. You could, for example, do the following:</p>\n<pre><code data-enlighter-language=\"null\">class Car\r\n{\r\n    public function __construct()\r\n    {\r\n        $this-&gt;engine = new Engine();\r\n\r\n        $this-&gt;wheels = [\r\n            new Wheel(), new Wheel(), \r\n            new Wheel(), new Wheel(),\r\n        ];\r\n    }\r\n\r\n    public function drive() { ... }\r\n}</code></pre>\n<p>There’s the blueprint for every car you’ll make! Next up, your boss comes to you and says there’s a new client and he wants an electrical car.</p>\n<p>So you end up doing this.</p>\n<pre><code data-enlighter-language=\"null\">class ElectricalCar extends Car\r\n{\r\n    public function __construct()\r\n    {\r\n        parent::__construct();\r\n\r\n        $this-&gt;engine = new ElectricalEngine();\r\n    }\r\n}</code></pre>\n<p>“Beautifully solved”—you think. There’s of course that redundant normal engine that’s created when calling <code>parent::__construct()</code>, but at least you could re-use the wheels!</p>\n<p>I think you can see where this is going. The next client wants a car with some fancy wheel covers, another one would like a diesel engine with those same wheel covers, another one requests a race car, and the last one wants a self driving car.<br />\nOh—there also was a client who wanted to buy an engine to build a boat with himself, but you told your boss that wouldn’t be possible.</p>\n<p>After a while, there’s a ton of blueprints in your office, each describing a very specific variation of a car. You started with a neatly ordered pile of blueprints. But after a while you had to group them in different folders and boxes, because it was taking too long to find the blueprint you’re looking for.</p>\n<p>Object oriented programmers often fall into this trap of inheritance, ending in a completely messed up codebase. So let’s look at a better approach. Maybe you’ve heard about “composition over inheritance” before?</p>\n<blockquote><p>Composition over inheritance is the principle that classes should achieve polymorphic behavior and code reuse by their composition rather than inheritance from a base or parent class—<a href=\"https://en.wikipedia.org/wiki/Composition_over_inheritance\" target=\"_blank\" rel=\"noreferrer noopener\">Wikipedia</a></p></blockquote>\n<p>That’s a lot of buzzwords. Let’s just look at our car example. The principle states that <code>Car</code> should achieve its polymorphic behaviour by being composed of other classes.</p>\n<p>The word <em>polymorphic</em> literally means “many shapes” and implies that <code>Car</code> should be able to do <code>drive</code> in many different ways, depending on the context it’s used in.</p>\n<p>With <em>code reuse</em>, we’re trying to make code reusable; so that we don’t end up with tens of classes doing almost exectly the same.</p>\n<h2>What does this have to do with dependency injection?</h2>\n<p>Instead of making a unique blueprint that describes every single possible variation of a car, we’d rather have <code>Car</code> do one thing, and do it good: drive.</p>\n<p>This means it shouldn’t be the car’s concern how its engine is built, what wheels it has attached. It should only know the follwing thing:</p>\n<blockquote><p>Given a working engine and four wheels, I’m able to drive!</p></blockquote>\n<p>We could say that in order for <code>Car</code> to work, it <em>needs</em> an engine and wheels. In other words: <code>Car</code> depends on <code>Engine</code> and a collection of <code>Wheels</code>.</p>\n<p>Those dependencies should be <em>given</em> to the car. Or, said otherwise: injected.</p>\n<pre><code data-enlighter-language=\"null\">class Car\r\n{\r\n    public function __construct(\r\n        Engine $engine, \r\n        array $wheels\r\n    ) {\r\n        $this-&gt;engine = $engine;\r\n        $this-&gt;wheels = $wheels;\r\n    }\r\n\r\n    public function drive()\r\n    {\r\n        $this-&gt;engine-&gt;connectTo($this-&gt;wheels);\r\n\r\n        $this-&gt;engine-&gt;start();\r\n\r\n        $this-&gt;engine-&gt;accelerate();\r\n    }\r\n}</code></pre>\n<p>Would you like a race car? No problem!</p>\n<pre><code data-enlighter-language=\"null\">$raceCar = new Car(new TurboEngine(), [\r\n    new RacingWheel(), new RacingWheel(),\r\n    new RacingWheel(), new RacingWheel(),\r\n]);</code></pre>\n<p>That client who wanted special wheel covers? You’ve got that covered!</p>\n<pre><code data-enlighter-language=\"null\">$smugCar = new Car(new Engine(), [\r\n    new FancyWheel(), new FancyWheel(),\r\n    new FancyWheel(), new FancyWheel(),\r\n]);</code></pre>\n<p>You’ve got <em>a lot</em> more flexibility now!</p>\n<p>Dependency injection is the idea of giving a class its requirements from the outside, instead of having that class being responsible for them itself.</p>\n<h2>What dependency injection is not</h2>\n<p>Built upon this simple principle, there are frameworks and tools that take it to the next level. You might, for example, have heard about the following things before.</p>\n<h3>Shared dependencies</h3>\n<p>One of the most beneficial side effects of injecting dependencies, is that the outside context can control them. This means that you can give the same instance of a class to several others that have a dependency on that class.</p>\n<p>Shared- or reusable dependencies are the ones most often getting the label “dependency injection”. Though it’s certainly a very good practice, sharing a dependency is not actually the core meaning of dependency injection.</p>\n<h3>The dependency container</h3>\n<p>Sometimes it’s also called “inversion of control” container, though that’s not an accurate name.</p>\n<p>Whatever the exact name, the container is a set of class definitions. It’s a big box that knows how objects in your application can be constructed with other dependencies. While such a container definitely has a lot of use cases, it’s not necessary to do dependency injection.</p>\n<h3>Auto wiring</h3>\n<p>To give developers even more flexibility, some containers allow for smart, automatically determined, class definitions. This means you don’t have to manually describe how every class should be constructed. These containers will scan your code, and determine which dependencies are needed by looking at type hints and doc blocks.</p>\n<p>A lot of magic happens here, but auto wiring can be a useful tool for rapid application development.</p>\n<h3>Service location</h3>\n<p>Instead of injecting dependencies into a class, there are some tools and frameworks that allow a class to ask the container to “give it an instance of another class”.</p>\n<p>This might seem beneficial at first, because our class doesn’t need to know how to construct a certain dependency anymore. However: by allowing a class to ask for dependencies on its own account, we’re back to square one.</p>\n<p>For service location to work, our class needs to know about the systems on the outside. It doesn’t differ a lot from calling <code>new</code>in the class itself. This idea is actually the opposite of what dependency injection tries to achieve. It’s a misuse of what the container is meant to do.</p>\n<h3>Inject everything</h3>\n<p>As it goes in real-life projects, you’ll notice that dependency injection in not <em>always</em> the solution for your problem.</p>\n<p>It’s important to realise that there’s limits to the benefits of everything. You should always be alert that you’re not taking this to the extreme, as there are valid cases in which a pragmatic approach <em>is</em> the better solution.</p>\n<h2>In closing</h2>\n<p>The core idea behind dependency injection is very simple, yet allows for better maintainable, testable and decoupled code to be written.</p>\n<p>Because it’s such a powerful pattern, it’s only natural that lots of tools emerge around it. I believe it’s a good thing to first understand the underlying principle, before using the tools built upon it. And I hope this blog post has helped with that.</p>\n<p>If there are any thoughts coming to your mind that you want to share, feel free to reach out to me on via <a href=\"https://twitter.com/brendt_gd\" target=\"_blank\" rel=\"noreferrer noopener\">Twitter</a> or <a href=\"mailto:brendt@stitcher.io\">e-mail</a>.</p>\n<p>Also special thanks to <a href=\"https://www.reddit.com/user/ImSuperObjective2\" target=\"_blank\" rel=\"noreferrer noopener\">/u/ImSuperObjective2</a> on Reddit and my colleague <a href=\"https://twitter.com/sebdedeyne\" target=\"_blank\" rel=\"noreferrer noopener\">Sebastian</a> for proof reading this post.</p>\n<div id=\"at_zurlpreview\">\n<h2>Dependency injection for beginners - stitcher.io</h2>\n<h3 style=\"display: none;\">Dependency injection for beginners - stitcher.io</h3>\n<p class=\"imgp\"><img class=\"alignnone size-full wp-image-562\" src=\"https://emolike.net/wp-content/uploads/2018/05/dependency-injection-for-beginners.png\" width=\"1280\" height=\"800\" srcset=\"https://emolike.net/wp-content/uploads/2018/05/dependency-injection-for-beginners.png 1280w, https://emolike.net/wp-content/uploads/2018/05/dependency-injection-for-beginners-300x188.png 300w, https://emolike.net/wp-content/uploads/2018/05/dependency-injection-for-beginners-768x480.png 768w, https://emolike.net/wp-content/uploads/2018/05/dependency-injection-for-beginners-1024x640.png 1024w, https://emolike.net/wp-content/uploads/2018/05/dependency-injection-for-beginners-432x270.png 432w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<p class=\"imgd\">A close look at what dependency injection is about—and what not.</p>\n<p class=\"imgs\">Source: <a href=\"https://www.stitcher.io/blog/dependency-injection-for-beginners\" target=\"_blank\" rel=\"noopener\">www.stitcher.io/blog/dependency-injection-for-beginners</a></p>\n</div>\n", "slug": "dependency-injection-for-beginners", "date": 1525799580, "cats": [0, 14, 17]}