{"title": "NVMe vs SSD vs HDD Performance", "content": "<p>A lot has changed in the world of computer storage in the past decade. Traditional spinning <a href=\"https://en.wikipedia.org/wiki/Hard_disk_drive\">hard disk drives</a> (HDD) have been outperformed by insanely fast and now affordable <a href=\"https://en.wikipedia.org/wiki/Solid-state_drive\">Solid State Drives</a> (SSD). And now we have insanely faster flash memory technology already available for the consumer market in the shape of <a href=\"https://en.wikipedia.org/wiki/NVM_Express\">Non-Volatile Memory Express</a> (NVMe), which is manufactured in a number of different interfaces / form factors, including <a href=\"https://en.wikipedia.org/wiki/M.2\">M.2</a>. Many photographers, including myself, experienced a huge boost in performance for post-processing large resolution files when switching from a hard drive to an SSD, but now that the faster flash memory is becoming more common, one might be wondering about the benefits of this new storage compared to both HDD and SSD drives. We have already published a detailed article on <a href=\"https://photographylife.com/the-ultimate-pc-build-for-photography-needs\">building a computer for photography</a>based on the latest generation Intel Skylake architecture, where we recommended to get the new generation motherboards with built-in M.2 slots for flash storage. Having built a similar computer myself for my post-processing and video editing needs, I thought it would be useful to share just how much faster the new storage is compared to both HDD and SSD drives, since I use all three in my large full tower setup.</p>\n<p>Many photographers still actively rely on hard disk drives, since they not only give more bang for the buck when compared to other storage types, but also provide a lot more storage to work with. And considering that photographs and video take enormous amounts of storage space, it is given that HDDs would be far more popular in comparison to everything else. When buying a brand new laptop or a computer, it is tough to decide what to go for – a much smaller, but faster SSD / PCIe flash memory, or a large capacity hard drive. And what makes it even more confusing, is that we now have hybrid hard drives, also known as “Fusion” drives, which are supposed to give the benefits of both SSD and HDD storage in a single package. What is the best storage type for photography needs? Such questions are very common among photographers, who try to plan their storage needs when shopping for new hardware.</p>\n<p>Unfortunately, there is no single right answer for everyone, because it all depends on each photographer’s <a href=\"https://photographylife.com/what-is-photography-workflow\">workflow</a> and how much storage is needed. For beefy storage environments with tens or even hundreds of thousands of RAW images and videos, no single type of storage would be sufficient, because there would most likely be two environments in place – one for current active projects (fast storage) and one for passive projects / archival (slower, large capacity storage). For smaller environments, a fast flash drive with a combination of either internal or external hard drive would suffice, where the photographer would place their operating system files, along with their active image catalog on the fastest flash storage, while storing images in slower, large capacity hard drives. And for someone who is starting out, a single, do-it-all drive would most likely suffice, with storage type depending on budget.</p>\n<p>For my personal and business needs, I have been heavily relying on SSD and HDD drives during the past years, some of which are placed in my computer, while others are a part of a large <a href=\"https://photographylife.com/reviews/synology-ds1815\">Synology storage array</a>. With 10+ years of images and the various video projects that I am currently working on, storage has been a very essential and integral part of my workflow, as I need to re-address both capacity and performance needs every few years. The main reason is time – if I can save hours of my time by using faster storage, it translates to more efficiency for the entire workflow. And I am not just talking about pure editing time, as storage is used for other critical parts of workflow, such as backup, as well.</p>\n<p>After upgrading my large tower machine with all-new computer components, which include the new flash storage in M.2 form factor (I rely on the currently fastest consumer-grade M.2 drive, the <a href=\"https://www.amazon.com/Samsung-960-PRO-Internal-MZ-V6P512BW/dp/B01LXS4TYB?tag=photolife0c-20\" rel=\"external nofollow\">Samsung 512 GB 960 Pro M.2 NVMe</a>), I decided to test out every drive of my new build and see what kinds of gains I would expect in terms of both read and write speeds. The results were quite shocking, as you can see below:</p>\n<p><img class=\"alignnone size-full wp-image-149\" src=\"https://emolike.net/wp-content/uploads/2018/03/NVMe-vs-SSD-vs-HDD.png\" alt=\"NVMe vs SSD vs HDD\" width=\"803\" height=\"733\" srcset=\"https://emolike.net/wp-content/uploads/2018/03/NVMe-vs-SSD-vs-HDD.png 803w, https://emolike.net/wp-content/uploads/2018/03/NVMe-vs-SSD-vs-HDD-300x274.png 300w, https://emolike.net/wp-content/uploads/2018/03/NVMe-vs-SSD-vs-HDD-768x701.png 768w, https://emolike.net/wp-content/uploads/2018/03/NVMe-vs-SSD-vs-HDD-200x183.png 200w\" sizes=\"(max-width: 803px) 100vw, 803px\" /></p>\n<p>In just read performance alone, my M.2 drive turned out to be a whopping 25x times faster than my enterprise-grade WD 2 TB 7200 RPM drive. That is just mind boggling, considering that SSD is only around 5x times faster in comparison. In write speed, I was able to witness up to 15x more performance, which is also a very impressive number. And that’s just for one type of sequential read/write load – if you look at the above numbers, other performance metrics indicate even larger, more noticeable gains.</p>\n<p>What does this all translate to? With so many camera manufacturers pushing for more resolution, many of us have been experiencing performance issues, with storage often being the bottleneck. If one can place their image catalogs on the fastest drive and use faster drives for storage of RAW images and video footage, the performance gains can be tremendous, especially during intensive workloads such as image and video export. And once file copy / move operations are involved, those benefits can become even more significant, especially for a busy professional.</p>\n<p><em>One thing to note – I am not suggesting that one would experience 25x performance gains just by switching from a hard drive to a flash drive when editing images, since there are many other factors involved, such as overall speed of the computer (CPU speed, number of CPU cores, total RAM and its speed, etc), the ability of the software to take full advantage of both the computer resources and the storage, etc. The software numbers from the above benchmarks might not apply the same way for everyday work.</em></p>\n<p>source: https://photographylife.com/nvme-vs-ssd-vs-hdd-performance</p>\n", "slug": "nvme-vs-ssd-vs-hdd-performance", "date": 1520959451, "cats": [10]}